Revit 2027 API
BuiltInFailures.AutoJoinFailures.DesignOptionAndWorksetViolation Property
 Can't make the expected join because of editability and design option restrictions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DesignOptionAndWorksetViolation { get; }
Public Shared ReadOnly Property DesignOptionAndWorksetViolation As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DesignOptionAndWorksetViolation {
	FailureDefinitionId^ get ();
}
static member DesignOptionAndWorksetViolation : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoJoinFailures Class
Autodesk.Revit.DB Namespace